; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared1 - mode
	thermograph2 - mode
	thermograph4 - mode
	infrared3 - mode
	thermograph0 - mode
	Star3 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
)
(:goal (and
	(pointing satellite0 Planet9)
	(pointing satellite1 Star0)
	(pointing satellite2 Planet8)
	(have_image Phenomenon7 thermograph0)
	(have_image Planet8 infrared1)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 thermograph2)
	(have_image Planet11 infrared3)
	(have_image Star12 infrared1)
))

)

; plan
1. (turn_to satellite3 star0 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 star0)
   goals met: 1 of 9
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 9
3. (calibrate satellite3 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 1 of 9
4. (turn_to satellite3 planet8 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet8)
   goals met: 1 of 9
5. (turn_to satellite2 groundstation6 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation6)
   goals met: 1 of 9
6. (turn_to satellite1 groundstation5 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation5)
   goals met: 1 of 9
7. (take_image satellite3 planet8 instrument5 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 2 of 9
8. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 2 of 9
9. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 9
10. (calibrate satellite2 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 2 of 9
11. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 2 of 9
12. (turn_to satellite1 phenomenon7 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 9
13. (take_image satellite1 phenomenon7 instrument1 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 3 of 9
14. (turn_to satellite1 star0 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star0)
   goals met: 4 of 9
15. (turn_to satellite2 phenomenon10 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 phenomenon10)
   goals met: 4 of 9
16. (take_image satellite2 phenomenon10 instrument2 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 5 of 9
17. (turn_to satellite2 planet11 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet11)
   goals met: 5 of 9
18. (take_image satellite2 planet11 instrument2 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 6 of 9
19. (turn_to satellite2 planet9 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet9)
   goals met: 6 of 9
20. (take_image satellite2 planet9 instrument2 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 7 of 9
21. (turn_to satellite2 planet8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet8)
   goals met: 8 of 9
22. (turn_to satellite3 star12 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star12)
   goals met: 8 of 9
23. (take_image satellite3 star12 instrument5 infrared1)
   added: (have_image star12 infrared1)
   goals met: 9 of 9
